import re
from ..Russian import different

male = ['Августин',
        'Авдей',
        'Авраам',
        'Агафон',
        'Адам',
        'Адриан',
        'Аким',
        'Алан',
        'Александр',
        'Алексей',
        'Альберт',
        'Альфред',
        'Амвросий',
        'Ананий',
        'Анастасий',
        'Анатолий',
        'Андрей',
        'Антон',
        'Аристарх',
        'Аркадий',
        'Арнольд',
        'Арсений',
        'Артем',
        'Артемий',
        'Артур',
        'Архип',
        'Афанасий',
        'Богдан',
        'Борис',
        'Булат',
        'Вадим',
        'Валентин',
        'Валерий',
        'Василий',
        'Вениамин',
        'Виктор',
        'Виссарион',
        'Виталий',
        'Владимир',
        'Владислав',
        'Всеволод',
        'Вячеслав',
        'Геннадий',
        'Георгий',
        'Герман',
        'Глеб',
        'Григорий',
        'Даниил',
        'Дементий',
        'Демьян',
        'Денис',
        'Дмитрий',
        'Евгений',
        'Егор',
        'Ефим',
        'Захар',
        'Зиновий',
        'Иван',
        'Игнатий',
        'Игорь',
        'Илья',
        'Иннокентий',
        'Кирилл',
        'Клим',
        'Константин',
        'Кузьма',
        'Лавр',
        'Лаврентий',
        'Лев',
        'Леонид',
        'Леонтий',
        'Лука',
        'Лукьян',
        'Макарий',
        'Максимилиан',
        'Марат',
        'Матвей',
        'Митрофан',
        'Михаил',
        'Михей',
        'Наум',
        'Нестор',
        'Николай',
        'Олег',
        'Олесь',
        'Осип',
        'Оскар',
        'Павел',
        'Петр',
        'Платон',
        'Родион',
        'Роман',
        'Ростислав',
        'Савва',
        'Самсон',
        'Семён',
        'Серафим',
        'Сергей',
        'Степан',
        'Тимофей',
        'Тимур',
        'Тихон',
        'Устин',
        'Федор',
        'Федот',
        'Филимон',
        'Флор',
        'Фома',
        'Харитон',
        'Христиан',
        'Эдгар',
        'Эдуард',
        'Эльдар',
        'Эмиль',
        'Эммануил',
        'Эрик',
        'Юлиан',
        'Юлий',
        'Юрий',
        'Яков',
        'Ян',
        'Яромир',
        'Ярослав',
        ]

female = ['Аврора',
          'Агата',
          'Агнесса',
          'Агния',
          'Ада',
          'Аза',
          'Алевтина',
          'Александра',
          'Алина',
          'Алиса',
          'Алла',
          'Альбина',
          'Альфреа',
          'Анастасия',
          'Ангелина',
          'Анжелика',
          'Анита',
          'Анна',
          'Антонина',
          'Анфиса',
          'Арина',
          'Астра',
          'Беата',
          'Белла',
          'Берта',
          'Богдана',
          'Борислава',
          'Бронислава',
          'Валентина',
          'Валерия',
          'Ванда',
          'Варвара',
          'Василиса',
          'Венера',
          'Вера',
          'Вероника',
          'Веста',
          'Виктория',
          'Виолетта',
          'Галина',
          'Гелена',
          'Гелла',
          'Генриетта',
          'Гертруда',
          'Глафира',
          'Глория',
          'Дарья',
          'Джульетта',
          'Диана',
          'Дина',
          'Доминика',
          'Ева',
          'Евгения',
          'Евдокия',
          'Екатерина',
          'Елена',
          'Елизавета',
          'Жанна',
          'Зинаида',
          'Зоя',
          'Иветта',
          'Изабелла',
          'Изольда',
          'Инара',
          'Инга',
          'Инесса',
          'Инна',
          'Ирина',
          'Ирма',
          'Камилла',
          'Капитолина',
          'Карина',
          'Каролина',
          'Катарина',
          'Кира',
          'Клавдия',
          'Клара',
          'Кристина',
          'Ксения',
          'Лада',
          'Лайма',
          'Лариса',
          'Леся',
          'Лиана',
          'Лидия',
          'Лилия',
          'Людмила',
          'Майя',
          'Маргарита',
          'Марианна',
          'Марина',
          'Мария',
          'Марта',
          'Марфа',
          'Милена',
          'Мирра',
          'Надежда',
          'Наталия',
          'Наталья',
          'Нина',
          'Нонна',
          'Нора',
          'Оксана',
          'Олеся',
          'Ольга',
          'Полина',
          'Прасковья',
          'Раиса',
          'Регина',
          'Рената',
          'Римма',
          'Роза',
          'Роксана',
          'Руслана',
          'Руфина',
          'Сара',
          'Светлана',
          'Серафима',
          'София',
          'Станислава',
          'Стелла',
          'Стефания',
          'Сюзанна',
          'Таира',
          'Таисия',
          'Тамара',
          'Татьяна',
          'Ульяна',
          'Фаина',
          'Фекла',
          'Флора',
          'Фома',
          'Франсуаза',
          'Фрида',
          'Христина',
          'Эдита',
          'Элеонора',
          'Эвелина',
          'Эльвира',
          'Эльза',
          'Эмилия',
          'Эрика',
          'Юлия',
          'Юнона',
          'Ядвига',
          'Яна',
          'Ярослава',
          ]

all_names = male + female

def different_males(rnd, count):
    return different(rnd, male, count)

def different_females(rnd, count):
    return different(rnd, female, count)

def different_names(rnd, count):
    cache = {}
    for i in male:
        if i in cache:
            cache[i[0]].append({'name': i, 'gender': 0})
        else:
            cache[i[0]] = [{'name': i, 'gender': 0}]
    for i in female:
        if i in cache:
            cache[i[0]].append({'name': i, 'gender': 1})
        else:
            cache[i[0]] = [{'name': i, 'gender': 1}]
    return [rnd.pick(cache[i]) for i in rnd.pick_n(count, cache.keys())]

def genitive(name):
    for i in range(len(name)):
        if re.search('[йь]$', name[i]):
            name[i] = re.sub('[йь]$', 'я', name[i])
        elif re.search('([егк])а$', name[i]):
            name[i] = re.sub('([егк])а$', lambda m: m[0] + 'и', name[i])
        elif re.search('а$', name[i]):
            name[i] = re.sub('а$', 'ы', name[i])
        elif re.search('я$', name[i]):
            name[i] = re.sub('я$', 'и', name[i])
        elif re.search('ев$', name[i]):
            name[i] = re.sub('ев$', 'ьва', name[i])
        elif re.search('Павел$', name[i]):
            name[i] = re.sub('Павел$', 'Павла', name[i])
        else:
            name[i] += 'a'

    return name

def ablative(name):
    for i in range(len(name)):
        if re.search('[йь]$', name[i]):
            name[i] = re.sub('[йь]$', 'ем', name[i])
        elif re.search('еа$', name[i]):
            name[i] = re.sub('еа$', 'еей', name[i])
        elif re.search('а$', name[i]):
            name[i] = re.sub('а$', 'ой', name[i])
        elif re.search('Илья$', name[i]):
            name[i] = re.sub('Илья$', 'Ильёй', name[i])
        elif re.search('я$', name[i]):
            name[i] = re.sub('я$', 'ей', name[i])
        elif re.search('ев$', name[i]):
            name[i] = re.sub('ев$', 'ьвом', name[i])
        elif re.search('Павел$', name[i]):
            name[i] = re.sub('Павел$', 'Павлом', name[i])
        else:
            name[i] += 'ом'

    return name

def dative(name):
    for i in range(len(name)):
        if re.search('[йь]$', name[i]):
            name[i] = re.sub('[йь]$', 'ю', name[i])
        elif re.search('а$', name[i]):
            name[i] = re.sub('а$', 'е', name[i])
        elif re.search('ия$', name[i]):
            name[i] = re.sub('ия$', 'ии', name[i])
        elif re.search('я$', name[i]):
            name[i] = re.sub('я$', 'е', name[i])
        elif re.search('ев$', name[i]):
            name[i] = re.sub('ев$', 'ьву', name[i])
        elif re.search('Павел$', name[i]):
            name[i] = re.sub('Павел$', 'Павлу', name[i])
        else:
            name[i] += 'у'

    return name
