import re

simple_names = ['Александр',
                'Алексей',
                'Анатолий',
                'Андрей',
                'Антон',
                'Аркадий',
                'Артём',
                'Борис',
                'Вадим',
                'Василий',
                'Виктор',
                'Виталий',
                'Владимир',
                'Вячеслав',
                'Геннадий',
                'Георгий',
                'Глеб',
                'Григорий',
                'Денис',
                'Дмитрий',
                'Евгений',
                'Егор',
                'Иван',
                'Кирилл',
                'Константин',
                'Леонид',
                'Михаил',
                'Николай',
                'Олег',
                'Петр',
                'Роман',
                'Семён',
                'Сергей',
                'Степан',
                'Тимофей',
                'Федор',
                'Эдуард',
                'Юрий',
                'Яков',
                ]

def genitive(name):
    for i in range(len(name)):
        if re.search('й$', name[i]):
            name[i] = re.sub('й$', 'я', name[i])
        else:
            name[i] += 'а'
    return name
